backend/src/templates/GetDepartures.xml

<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:typ="http://thalesgroup.com/RTTI/2013-11-28/Token/types"
	xmlns:ldb="http://thalesgroup.com/RTTI/2017-10-01/ldb/">
	<soap:Header>
		<typ:AccessToken>
			<typ:TokenValue>!!TOKEN!!</typ:TokenValue>
		</typ:AccessToken>
	</soap:Header>
	<soap:Body>
		<ldb:GetDepartureBoardRequest>
			<ldb:numRows>!!NUMROWS!!</ldb:numRows>
			<ldb:crs>!!CRS!!</ldb:crs>
			<ldb:filterCrs>!!FILTERCRS!!</ldb:filterCrs>
			<ldb:filterType>!!FILTERTYPE!!</ldb:filterType>
			<ldb:timeOffset>!!TIMEOFFSET!!</ldb:timeOffset>
			<ldb:timeWindow>!!TIMEWINDOW!!</ldb:timeWindow>
		</ldb:GetDepartureBoardRequest>
	</soap:Body>
</soap:Envelope>